model {
  ssd {
    num_classes: 3   # [MUST] match the number of categories in the training set
    image_resizer {
      fixed_shape_resizer {   # [OPTION] depending on the models, different resizer or parameters can be used
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2"   # [MUST] make sure this matches with the model to be used
      ## omitted ##
    }
    ## omitted ##
    anchor_generator {
      ssd_anchor_generator {   # [SHOULD] update scales and aspect_ratios which match with most boxes drown
        num_layers: 6
        min_scale: 0.04
        max_scale: 0.4
        aspect_ratios: 0.5
        aspect_ratios: 0.46
        aspect_ratios: 0.43
        aspect_ratios: 0.4
        aspect_ratios: 0.37
      }
    }
## omitted ##
train_config {
  batch_size: 8   # [MUST] too big number will cause out of memory error
  ## omitted ##
  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {   # [MUST] dependin on how many steps to execute, change the values
          initial_learning_rate: 0.005
          decay_steps: 40000
          decay_factor: 0.1
          burnin_learning_rate: 0.005
          burnin_steps: 2000
          min_learning_rate: 0.0001
          staircase: false
        }
      }
      ## omitted ##
    }
  }
  fine_tune_checkpoint: "/content/models/research/pretrained_model/model.ckpt"   # [MUST] update the path (/content is for Colab)
  num_steps: 50000    # [MUST] update how many steps to execute
  fine_tune_checkpoint_type: "detection"   # [MUST] update to "detection" if it is different
}
train_input_reader {
  label_map_path: "annotations/label_map.pbtxt"   # [MUST] update the path
  tf_record_input_reader {
    input_path: "annotations/train.record"   # [MUST] update the path
  }
}
eval_config {
  num_examples: 50    # [OPTION] fine as long as the number is larger than the number of test images 
  metrics_set: "coco_detection_metrics"   # [OPTION] can be added to use coco metrix in the evaluation
  use_moving_averages: false   # [MUST] update to false if it is different
}
eval_input_reader {
  label_map_path: "annotations/label_map.pbtxt"   # [MUST] update the path
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "annotations/test.record"   # [MUST] update the path
  }
}
